/**
 * 
 * JSON格式的数据：特定格式的字符串
 * 对象{}或者是数组[]
 * json格式的对象或者json格式的数据
 * json数据的类型:{}或者[]
 * json数据的值的类型:
 * {"字符串":字符串/数字/对象/布尔...}
 * [值1,值2,值3]
 * 值的类型:字符串/数字/对象/布尔/数组
 * var obj={name:'小明'}
 * obj['name']
 * 
 * json格式的数据的结构或者类型
 * {
 *  obj:{},
 *  names:[]
 * }
 * 
 * [{},{},{}]
 * {
 * goods:[],
 * ratings:[],
 * info:{}
 * }
 * 
 * return goods
 * return {goods}
 * 
 * data.json文件
 * {
 *    goods:[
 *      {
 *        name:'优惠',
 *        icon:'图片地址',
 *        foods:[
 *            {},
 *        ]
 *      },
 *      {
 *        name:'折扣',
 *        icon:'图片地址'
 *      },
 *      {},
 *      {},
 *    ],
 *    ratings:[
 *      {
 *        avator:'头像',
 *        name:'用户名',
 *        rating:3.2
 *        date:2019
 *        text:'内容'
 *      }
 *    ],
 *    info:{
 *      name:'嘉禾',
 *      地址,价格，分数，头像,距离,活动,时间
 *    }
 * }
 * 
 * 
 * 总结:后台给前台返回一个结构的数据{}
 * 
 * 
 * 
 * 
 * 
 * 后台:----->前台
 * 
 * 
 */